### CHAPTER 7
# Data Cleaning and Preparation

In [538]:
import pandas as pd
import numpy as np

In [539]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [540]:
float_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [541]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [542]:
string_data.isnull()

0    False
1     True
2     True
3    False
dtype: bool

In [543]:
float_data = pd.Series([1, 2, None], dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [544]:
float_data.isnull()

0    False
1    False
2     True
dtype: bool

In [545]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [546]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [547]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [548]:
data.dropna()  # Drops any row with NaN values

     0    1    2
0  1.0  6.5  3.0

In [549]:
data.dropna(how='all')  # Drops any row with all NaN values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [550]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [551]:
data.dropna(axis="columns", how='all')  # Drops any column with all NaN values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [552]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0 -0.051474  1.373084  0.872305
1  0.267363 -0.703274 -1.591471
2  2.259874 -0.283398  1.042649
3  1.351715  0.538618  0.373732
4  2.393399 -0.353465 -0.902954
5 -0.788108 -1.314493 -0.870455
6 -0.563057 -1.647199  1.088538

In [553]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -0.051474       NaN       NaN
1  0.267363       NaN       NaN
2  2.259874       NaN  1.042649
3  1.351715       NaN  0.373732
4  2.393399 -0.353465 -0.902954
5 -0.788108 -1.314493 -0.870455
6 -0.563057 -1.647199  1.088538

In [554]:
df.dropna()

          0         1         2
4  2.393399 -0.353465 -0.902954
5 -0.788108 -1.314493 -0.870455
6 -0.563057 -1.647199  1.088538

In [555]:
df.dropna(thresh=2)  # Keep only rows with at least 2 non-NaN values

          0         1         2
2  2.259874       NaN  1.042649
3  1.351715       NaN  0.373732
4  2.393399 -0.353465 -0.902954
5 -0.788108 -1.314493 -0.870455
6 -0.563057 -1.647199  1.088538

### Filling In Missing Data

In [556]:
df.fillna(0)  # Fill NaN values with 0

          0         1         2
0 -0.051474  0.000000  0.000000
1  0.267363  0.000000  0.000000
2  2.259874  0.000000  1.042649
3  1.351715  0.000000  0.373732
4  2.393399 -0.353465 -0.902954
5 -0.788108 -1.314493 -0.870455
6 -0.563057 -1.647199  1.088538

In [557]:
df.fillna({1:0.5, 2:0})  # Fill NaN values in column 1 with 0.5 and column 2 with 0

          0         1         2
0 -0.051474  0.500000  0.000000
1  0.267363  0.500000  0.000000
2  2.259874  0.500000  1.042649
3  1.351715  0.500000  0.373732
4  2.393399 -0.353465 -0.902954
5 -0.788108 -1.314493 -0.870455
6 -0.563057 -1.647199  1.088538

In [558]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  0.785836  0.272628 -0.845693
1  0.481162  0.327954 -0.726246
2  0.071763       NaN  1.794635
3  1.166526       NaN  1.222106
4  0.705442       NaN       NaN
5 -0.862921       NaN       NaN

In [559]:
df.fillna(method='ffill')  # Forward fill NaN values

C:\Users\sahor\AppData\Local\Temp\ipykernel_1048\2883871002.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')  # Forward fill NaN values

          0         1         2
0  0.785836  0.272628 -0.845693
1  0.481162  0.327954 -0.726246
2  0.071763  0.327954  1.794635
3  1.166526  0.327954  1.222106
4  0.705442  0.327954  1.222106
5 -0.862921  0.327954  1.222106

In [560]:
df.fillna(method='ffill', limit=2)  # Forward fill NaN values with a limit of 2

C:\Users\sahor\AppData\Local\Temp\ipykernel_1048\3537515366.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)  # Forward fill NaN values with a limit of 2

          0         1         2
0  0.785836  0.272628 -0.845693
1  0.481162  0.327954 -0.726246
2  0.071763  0.327954  1.794635
3  1.166526  0.327954  1.222106
4  0.705442       NaN  1.222106
5 -0.862921       NaN  1.222106

In [561]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [562]:
data.fillna(data.mean())  # Fill NaN values with the mean of the Series

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation

### Removing Duplicates

In [563]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [564]:
data.duplicated()  # Check for duplicate rows

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [565]:
data.drop_duplicates()  # Drop duplicate rows

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [566]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [567]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [568]:
data.drop_duplicates(subset=["k1"])  # Drop duplicates based on column 'k1'

    k1  k2  v1
0  one   1   0
1  two   1   1

In [569]:
data.drop_duplicates(["k1", "k2"], keep="last")  # Drop duplicates based on columns 'k1' and 'k2'

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [570]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [571]:
meat_to_animal = {
 "bacon": "pig",
 "pulled pork": "pig",
 "pastrami": "cow",
 "corned beef": "cow",
 "honey ham": "pig",
 "nova lox": "salmon"
}
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [572]:
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [573]:
data =pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [574]:
data.replace(-999, np.nan)  # Replace -999 with NaN

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [575]:
data.replace([-999, -1000], np.nan)  # Replace -999 and -1000 with NaN

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [576]:
data.replace([-999, -1000], [np.nan, 0])  # Replace -999 with NaN and -1000 with 0

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [577]:
data.replace({-999:np.nan, -1000:0})  # Replace -999 with NaN and -1000 with 0 using a dictionary

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [578]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

### Renaming Axis Indexes

In [579]:
data = pd.DataFrame(np.arange(12).reshape(3, 4), 
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [580]:
def transform(x):
    return x[:4].upper()
data.index = data.index.map(transform)

In [581]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [582]:
data.rename(index=str.title, columns=str.upper)  # Rename index and columns with functions

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [583]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [584]:
data.rename(index={"OHIO": "INDIANA"}, columns={"three": "peekaboo"})  # Rename specific index and column labels

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [585]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

### Discretization and Binning

In [586]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [587]:
age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [588]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [589]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [590]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [591]:
pd.value_counts(age_categories)

C:\Users\sahor\AppData\Local\Temp\ipykernel_1048\3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [592]:
pd.cut(ages, bins, right=False)  # Left-inclusive bins

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [593]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)  # Use custom labels for the bins

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [594]:
data = np.random.uniform(size=20)
pd.cut(data, 4, precision=2)  # Cut into 4 equal-width bins with 2 decimal places

[(0.67, 0.89], (0.67, 0.89], (0.45, 0.67], (0.45, 0.67], (0.23, 0.45], ..., (0.45, 0.67], (0.67, 0.89], (0.67, 0.89], (0.67, 0.89], (0.012, 0.23]]
Length: 20
Categories (4, interval[float64, right]): [(0.012, 0.23] < (0.23, 0.45] < (0.45, 0.67] < (0.67, 0.89]]

In [595]:
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2)  # Cut into 4 equal-size bins with 2 decimal places
quartiles

[(-0.62, -0.00016], (0.68, 3.44], (0.68, 3.44], (-0.00016, 0.68], (-0.62, -0.00016], ..., (0.68, 3.44], (-3.0199999999999996, -0.62], (-0.00016, 0.68], (-0.62, -0.00016], (0.68, 3.44]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.0199999999999996, -0.62] < (-0.62, -0.00016] < (-0.00016, 0.68] < (0.68, 3.44]]

In [596]:
pd.value_counts(quartiles)

C:\Users\sahor\AppData\Local\Temp\ipykernel_1048\3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.0199999999999996, -0.62]    250
(-0.62, -0.00016]               250
(-0.00016, 0.68]                250
(0.68, 3.44]                    250
Name: count, dtype: int64

In [597]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.0]).value_counts()

(-3.0069999999999997, -1.222]    100
(-1.222, -0.000156]              400
(-0.000156, 1.209]               400
(1.209, 3.435]                   100
Name: count, dtype: int64

### Detecting and Filtering Outliers

In [598]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.002946     0.035915     0.004142     0.081327
std       0.984723     0.993254     0.981685     0.997155
min      -2.783311    -2.760943    -2.934348    -2.777878
25%      -0.647934    -0.613619    -0.670096    -0.618451
50%      -0.010480     0.024284     0.046725     0.069396
75%       0.642403     0.694372     0.706453     0.760368
max       3.535234     3.092659     2.620170     3.630830

In [599]:
col = data[2]
col[col.abs() > 3]

Series([], Name: 2, dtype: float64)

In [600]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
228  0.466558  3.092659  0.977517  1.943949
460 -0.720004 -0.130959 -0.931314  3.630830
857  0.081175 -1.660303 -2.449614  3.101782
935  3.535234 -0.467209 -0.007825 -0.550866

In [601]:
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.003482     0.035822     0.004142     0.080595
std       0.982942     0.992973     0.981685     0.994801
min      -2.783311    -2.760943    -2.934348    -2.777878
25%      -0.647934    -0.613619    -0.670096    -0.618451
50%      -0.010480     0.024284     0.046725     0.069396
75%       0.642403     0.694372     0.706453     0.760368
max       3.000000     3.000000     2.620170     3.000000

In [602]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1 -1.0 -1.0  1.0  1.0
2  1.0 -1.0 -1.0 -1.0
3  1.0  1.0  1.0 -1.0
4 -1.0  1.0  1.0 -1.0

### Permutation and Random Sampling

In [603]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [604]:
sampler = np.random.permutation(5)
sampler

array([1, 4, 2, 3, 0], dtype=int32)

In [605]:
len(df)

5

In [606]:
df.take(sampler)  # Randomly permute the rows of the DataFrame

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6

In [607]:
df.iloc[sampler]  # Randomly permute the rows of the DataFrame

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
0   0   1   2   3   4   5   6

In [608]:
df.sample(n=3)  # Randomly sample 3 rows from the DataFrame

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [609]:
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [610]:
choices.sample(n=10, replace=True)  # Sample with replacement

4    4
2   -1
0    5
3    6
0    5
3    6
2   -1
2   -1
2   -1
2   -1
dtype: int64

In [611]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64